[
    {
        "title":"Jeffrey Epstein Had a ‘Personal Hacker,’ Informant Claims",
        "description":"Plus: AI agent OpenClaw gives cybersecurity experts the willies, China executes 11 scam compound bosses, a $40 million crypto theft has an unexpected alleged culprit, and more.",
        "content":"As the standoff between the United States government and Minnesota continues this week over immigration enforcement operations that have essentially occupied the Twin Cities and other parts of the st… [+4742 chars]",
        "source":"Wired",
        "published_at":"2026-01-31T11:30:00Z",
        "url":"https:\/\/www.wired.com\/story\/security-news-this-week-jeffrey-epstein-had-a-personal-hacker-informant-claims\/",
        "topic":"cybersecurity"
    },
    {
        "title":"OpenClaw’s AI ‘skill’ extensions are a security nightmare",
        "description":"OpenClaw, the AI agent that has exploded in popularity over the past week, is raising new security concerns after researchers uncovered malware in hundreds of user-submitted \"skill\" add-ons on its marketplace. In a post on Monday, 1Password product VP Jason M…",
        "content":"<ul><li><\/li><li><\/li><li><\/li><\/ul>\r\nSecurity researchers found hundreds of malicious add-ons on ClawHub.\r\nSecurity researchers found hundreds of malicious add-ons on ClawHub.\r\nby\r\nEmma RothClose\r\nP… [+3311 chars]",
        "source":"The Verge",
        "published_at":"2026-02-04T19:03:38Z",
        "url":"https:\/\/www.theverge.com\/news\/874011\/openclaw-ai-skill-clawhub-extensions-security-nightmare",
        "topic":"cybersecurity"
    },
    {
        "title":"Deleting Data Just Got Easier for Californians, but It’s Just One Piece of the Larger Cybersecurity Puzzle",
        "description":"The newly launched DROP portal could be a game-changer for Californians’ privacy, even though it’s not a replacement for a holistic cybersecurity approach.",
        "content":"You can feel helpless when you don’t have control over your personal data, especially while data brokers with little concern for your privacy are making billions buying and selling hoards of consumer… [+11241 chars]",
        "source":"CNET",
        "published_at":"2026-01-28T15:00:00Z",
        "url":"https:\/\/www.cnet.com\/tech\/services-and-software\/deleting-data-just-got-easier-for-californians-but-its-just-one-piece-of-the-larger-cybersecurity-puzzle\/",
        "topic":"cybersecurity"
    },
    {
        "title":"NordVPN Software Blocked 92% of Phishing Emails in Independent Testing",
        "description":"Phishing attempts continue to grow with help from generative AI and its believable deepfakes and voice impersonations.",
        "content":"NordVPN's anti-malware software Threat Protection Pro blocked 92% of phishing websites in an independent lab test of several antivirus products, browsers and VPNs in results released this week. \r\nAV-… [+3573 chars]",
        "source":"CNET",
        "published_at":"2026-02-01T18:20:43Z",
        "url":"https:\/\/www.cnet.com\/tech\/services-and-software\/nordvpn-anti-phishing-lab-test\/",
        "topic":"cybersecurity"
    },
    {
        "title":"Nitrogen ransomware is so broken even the crooks can't unlock your files",
        "description":"Gang walks away with nothing, victims are left with irreparable hypervisors\nCybersecurity experts usually advise victims against paying ransomware crooks, but that advice goes double for those who have been targeted by the Nitrogen group. There's no way to ge…",
        "content":"Cybersecurity experts usually advise victims against paying ransomware crooks, but that advice goes double for those who have been targeted by the Nitrogen group. There's no way to get your data back… [+2081 chars]",
        "source":"Theregister.com",
        "published_at":"2026-02-04T13:50:49Z",
        "url":"https:\/\/www.theregister.com\/2026\/02\/04\/nitrogen_ransomware_broken_decryptor\/",
        "topic":"cybersecurity"
    },
    {
        "title":"Android malware hidden in fake antivirus app",
        "description":"Fake antivirus app TrustBastion uses Hugging Face to deliver Android malware that captures screenshots, steals PINs and shows fake login screens, according to Bitdefender.",
        "content":"If you use an Android phone, this deserves your attention. Right now, cybersecurity researchers warn that hackers are using Hugging Face, a popular platform for sharing artificial intelligence (AI) t… [+8456 chars]",
        "source":"Fox News",
        "published_at":"2026-02-14T19:22:13Z",
        "url":"https:\/\/www.foxnews.com\/tech\/android-malware-hidden-fake-antivirus-app",
        "topic":"cybersecurity"
    },
    {
        "title":"I made my Pixel a lot more secure by enabling this one setting",
        "description":"Enabling Advanced Protection on your Pixel can block insecure connections and boost malware and scam protection.",
        "content":"Google Pixels are already among the most secure Android phones you can buy today. In fact, Google even claims that Android phones now block more scams than iPhones, which have long been perceived as … [+5117 chars]",
        "source":"Android Central",
        "published_at":"2026-02-07T17:06:04Z",
        "url":"https:\/\/www.androidcentral.com\/phones\/google-pixel\/i-made-my-pixel-a-lot-more-secure-by-enabling-this-one-setting",
        "topic":"cybersecurity"
    },
    {
        "title":"The TikTok deal is done, finally",
        "description":"Just over a year after it briefly disappeared from app stores, TikTok in the US is now part of a new entity, TikTok USDS Joint Venture LLC. With approval from both the US and China closing on the schedule laid out in December, ByteDance's ownership of the new…",
        "content":"<ul><li><\/li><li><\/li><li><\/li><\/ul>\r\nTikTok is now under new ownership in the US, but what happens next?\r\nTikTok is now under new ownership in the US, but what happens next?\r\nby\r\nRichard LawlerClose… [+4598 chars]",
        "source":"The Verge",
        "published_at":"2026-01-23T01:05:20Z",
        "url":"https:\/\/www.theverge.com\/tech\/866437\/tiktok-usds-bytedance-sale-oracle-mgx",
        "topic":"cybersecurity"
    },
    {
        "title":"Under Armour data breach claims trigger alerts for millions of users",
        "description":"Under Armour allegedly faces massive data breach affecting 72 million customers after hackers posted records online following November ransomware attack.",
        "content":"Sportswear and fitness brand Under Armour is investigating claims of a massive data breach after customer records were posted on a hacker forum. \r\nThe breach became widely known after millions of peo… [+9127 chars]",
        "source":"Fox News",
        "published_at":"2026-01-30T19:00:43Z",
        "url":"https:\/\/www.foxnews.com\/tech\/under-armour-data-breach-claims-trigger-alerts-millions-users",
        "topic":"cybersecurity"
    },
    {
        "title":"Malicious Google Chrome extensions hijack accounts",
        "description":"Malicious Chrome extensions steal login data by impersonating Workday, NetSuite and SAP SuccessFactors platforms, cybersecurity researchers say.",
        "content":"Cybersecurity researchers have uncovered a serious threat hiding inside Google Chrome. \r\nSeveral browser extensions pretend to be helpful tools. In reality, they quietly take over user accounts. Thes… [+9005 chars]",
        "source":"Fox News",
        "published_at":"2026-01-26T16:17:09Z",
        "url":"https:\/\/www.foxnews.com\/tech\/malicious-google-chrome-extensions-hijack-accounts",
        "topic":"cybersecurity"
    },
    {
        "title":"Cybersecurity startup Lema has come out of stealth to raise $24 million",
        "description":"Lema, a cybersecurity startup founded by former members of Israel's elite intelligence unit, is coming out of stealth and announcing fresh funding.",
        "content":"Lema founders left to right: Omer Yehudai (CPO), Eddie Dovzhik (CEO), and Tomer Roizman (CTO).Netanel Tobias\r\n<ul><li>Lema is a cybersecurity startup founded by former members of Israel's elite 8200 … [+2845 chars]",
        "source":"Business Insider",
        "published_at":"2026-02-09T14:00:01Z",
        "url":"https:\/\/www.businessinsider.com\/lema-has-come-out-of-stealth-to-raise-24-million-2026-2",
        "topic":"cybersecurity"
    },
    {
        "title":"Gmail’s spam filter and automatic sorting are broken",
        "description":"Some Gmail users have noticed that promotional emails that normally go to their own siloed tab have started flooding their inbox. Reports have been hitting the Google forums and Reddit that messages are bypassing the Updates and Promotional filters and going …",
        "content":"<ul><li><\/li><li><\/li><li><\/li><\/ul>\r\nUsers inboxes have been flooded with promotional emails and warnings to be careful.\r\nUsers inboxes have been flooded with promotional emails and warnings to be c… [+2114 chars]",
        "source":"The Verge",
        "published_at":"2026-01-24T17:54:10Z",
        "url":"https:\/\/www.theverge.com\/tech\/867247\/gmails-spam-filter-broken",
        "topic":"cybersecurity"
    },
    {
        "title":"Reco raises $30 million as AI goes from 'blocked' to a must-have",
        "description":"Cybersecurity firm Reco, co-founded by Ofer Klein, Gal Nakash, Tal Shapira, secures $30M Series B funding to expand AI security solutions.",
        "content":"Reco co-founders Ofer Klein, Gal Nakash and Tal ShapiraReco\r\n<ul><li>Reco raised $30 million in Series B amid rising demand for AI cybersecurity.<\/li><li>Zeev Ventures led Reco's funding, doubling do… [+2888 chars]",
        "source":"Business Insider",
        "published_at":"2026-02-10T15:00:01Z",
        "url":"https:\/\/www.businessinsider.com\/reco-raises-30-m-series-b-ai-cybersecurity-demand-2026-2",
        "topic":"cybersecurity"
    },
    {
        "title":"Surfshark VPN Now Offers 'Post-Quantum' Protection. Cybersecurity Is Behind the Move",
        "description":"Quantum computing poses risks, including the ability to break encryption. That's why Surfshark is preparing.",
        "content":"VPN service provider Surfshark announced on Tuesday that its WireGuard VPN protocol now offers post-quantum protection. \r\nYou may have heard \"quantum\" used in a loose way in your favorite sci-fi show… [+1938 chars]",
        "source":"CNET",
        "published_at":"2026-01-22T21:16:09Z",
        "url":"https:\/\/www.cnet.com\/tech\/services-and-software\/surfshark-vpn-now-offers-post-quantum-protection-cybersecurity-is-behind-the-move\/",
        "topic":"cybersecurity"
    },
    {
        "title":"Former Canonical Developer Advocate Warns Snap Store Isn't Safe After Slow Responses to Malware Reports",
        "description":"An anonymous reader shared this article from the blog Linuxiac\nIn a blog post, Alan Pope, a longtime Ubuntu community figure and former Canonical employee who remains an active Snap publisher... [warns of] a persistent campaign of malicious snaps impersonatin…",
        "content":"An anonymous reader shared this article from the blog LinuxiacIn a blog post, Alan Pope, a longtime Ubuntu community figure and former Canonical employee who remains an active Snap publisher... [warn… [+1691 chars]",
        "source":"Slashdot.org",
        "published_at":"2026-01-25T08:44:00Z",
        "url":"https:\/\/linux.slashdot.org\/story\/26\/01\/24\/2332205\/former-canonical-developer-advocate-warns-snap-store-isnt-safe-after-slow-responses-to-malware-reports",
        "topic":"cybersecurity"
    },
    {
        "title":"Reynolds Ransomware Embeds BYOVD Driver to Disable EDR Security Tools",
        "description":"Cybersecurity researchers have disclosed details of an emergent ransomware family dubbed Reynolds that comes embedded with a built-in bring your own vulnerable driver (BYOVD) component for defense evasion purposes within the ransomware payload itself.\nBYOVD r…",
        "content":"Cybersecurity researchers have disclosed details of an emergent ransomware family dubbed Reynolds that comes embedded with a built-in bring your own vulnerable driver (BYOVD) component for defense ev… [+8071 chars]",
        "source":"Internet",
        "published_at":"2026-02-10T14:36:00Z",
        "url":"https:\/\/thehackernews.com\/2026\/02\/reynolds-ransomware-embeds-byovd-driver.html",
        "topic":"cybersecurity"
    },
    {
        "title":"Supply chain attacks now fuel a 'self-reinforcing' cybercrime economy",
        "description":"Researchers say breaches link identity abuse, SaaS compromise, and ransomware into a cascading cycle\nCybercriminals are turning supply chain attacks into an industrial-scale operation, linking breaches, credential theft, and ransomware into a \"self-reinforcin…",
        "content":"Cybercriminals are turning supply chain attacks into an industrial-scale operation, linking breaches, credential theft, and ransomware into a \"self-reinforcing\" ecosystem, researchers say.\r\nIn its la… [+2965 chars]",
        "source":"Theregister.com",
        "published_at":"2026-02-12T11:59:09Z",
        "url":"https:\/\/www.theregister.com\/2026\/02\/12\/supply_chain_attacks\/",
        "topic":"cybersecurity"
    },
    {
        "title":"How to safely view your bank and retirement accounts online",
        "description":"Expert cybersecurity tips to protect your online banking and investment accounts from hackers. Learn essential security habits that keep your money safe.",
        "content":"Logging into your bank, retirement or investment accounts is now part of everyday life. Still, for many people, it comes with a knot in the stomach. You hear about hacks, scams and stolen identities … [+6416 chars]",
        "source":"Fox News",
        "published_at":"2026-02-12T18:00:12Z",
        "url":"https:\/\/www.foxnews.com\/tech\/how-safely-view-your-bank-retirement-accounts-online",
        "topic":"cybersecurity"
    },
    {
        "title":"Moscow likely behind wiper attack on Poland’s power grid, experts say",
        "description":"Cyber sleuths believe Sandworm up to its old tricks with a brand-new sabotage toy\nRussia was probably behind the failed attempts to compromise the systems of Poland's power companies in December, cybersecurity researchers claim.…",
        "content":"Russia was probably behind the failed attempts to compromise the systems of Poland's power companies in December, cybersecurity researchers claim.\r\nESET attributed the attack with \"medium\" confidence… [+2809 chars]",
        "source":"Theregister.com",
        "published_at":"2026-01-26T11:54:44Z",
        "url":"https:\/\/www.theregister.com\/2026\/01\/26\/moscow_likely_behind_wiper_attack\/",
        "topic":"cybersecurity"
    },
    {
        "title":"New ZeroDayRAT Mobile Spyware Enables Real-Time Surveillance and Data Theft",
        "description":"Cybersecurity researchers have disclosed details of a new mobile spyware platform dubbed ZeroDayRAT that's being advertised on Telegram as a way to grab sensitive data and facilitate real-time surveillance on Android and iOS devices.\n\"The developer runs dedic…",
        "content":"Cybersecurity researchers have disclosed details of a new mobile spyware platform dubbed ZeroDayRAT that's being advertised on Telegram as a way to grab sensitive data and facilitate real-time survei… [+10631 chars]",
        "source":"Internet",
        "published_at":"2026-02-16T10:24:00Z",
        "url":"https:\/\/thehackernews.com\/2026\/02\/new-zerodayrat-mobile-spyware-enables.html",
        "topic":"cybersecurity"
    },
    {
        "title":"The El Paso No-Fly Debacle Is Just the Beginning of a Drone Defense Mess",
        "description":"Fears over a drug cartel drone over Texas sparked a recent airspace shutdown in El Paso and New Mexico, highlighting just how tricky it can be to deploy anti-drone weapons near cities.",
        "content":"A shocking but ultimately brief airspace closure over El Paso, Texas, and parts of New Mexico last week is stoking unease among pilots and the broader public about the status of United States anti-dr… [+3574 chars]",
        "source":"Wired",
        "published_at":"2026-02-16T11:30:00Z",
        "url":"https:\/\/www.wired.com\/story\/the-el-paso-no-fly-debacle-is-just-the-beginning-of-the-drone-defense-mess\/",
        "topic":"cybersecurity"
    },
    {
        "title":"New Osiris Ransomware Emerges as New Strain Using POORTRY Driver in BYOVD Attack",
        "description":"Cybersecurity researchers have disclosed details of a new ransomware family called Osiris that targeted a major food service franchisee operator in Southeast Asia in November 2025.\nThe attack leveraged a malicious driver called POORTRY as part of a known tech…",
        "content":"Cybersecurity researchers have disclosed details of a new ransomware family called Osiris that targeted a major food service franchisee operator in Southeast Asia in November 2025.\r\nThe attack levera… [+7864 chars]",
        "source":"Internet",
        "published_at":"2026-01-22T18:00:00Z",
        "url":"https:\/\/thehackernews.com\/2026\/01\/new-osiris-ransomware-emerges-as-new.html",
        "topic":"cybersecurity"
    },
    {
        "title":"Indian Users Targeted in Tax Phishing Campaign Delivering Blackmoon Malware",
        "description":"Cybersecurity researchers have discovered an ongoing campaign that's targeting Indian users with a multi-stage backdoor as part of a suspected cyber espionage campaign.\nThe activity, per the eSentire Threat Response Unit (TRU), involves using phishing emails …",
        "content":"Cybersecurity researchers have discovered an ongoing campaign that's targeting Indian users with a multi-stage backdoor as part of a suspected cyber espionage campaign.\r\nThe activity, per the eSentir… [+3699 chars]",
        "source":"Internet",
        "published_at":"2026-01-26T17:01:00Z",
        "url":"https:\/\/thehackernews.com\/2026\/01\/indian-users-targeted-in-tax-phishing.html",
        "topic":"cybersecurity"
    },
    {
        "title":"Evelyn Stealer Malware Abuses VS Code Extensions to Steal Developer Credentials and Crypto",
        "description":"Cybersecurity researchers have disclosed details of a malware campaign that's targeting software developers with a new information stealer called Evelyn Stealer by weaponizing the Microsoft Visual Studio Code (VS Code) extension ecosystem.\n\"The malware is des…",
        "content":"Cybersecurity researchers have disclosed details of a malware campaign that's targeting software developers with a new information stealer called Evelyn Stealer by weaponizing the Microsoft Visual St… [+3865 chars]",
        "source":"Internet",
        "published_at":"2026-01-20T11:48:00Z",
        "url":"https:\/\/thehackernews.com\/2026\/01\/evelyn-stealer-malware-abuses-vs-code.html",
        "topic":"cybersecurity"
    },
    {
        "title":"From Ransomware to Residency: Inside the Rise of the Digital Parasite",
        "description":"Are ransomware and encryption still the defining signals of modern cyberattacks, or has the industry been too fixated on noise while missing a more dangerous shift happening quietly all around them?\nAccording to Picus Labs’ new Red Report 2026, which analyzed…",
        "content":"Are ransomware and encryption still the defining signals of modern cyberattacks, or has the industry been too fixated on noise while missing a more dangerous shift happening quietly all around them?\r… [+9491 chars]",
        "source":"Internet",
        "published_at":"2026-02-10T13:59:00Z",
        "url":"https:\/\/thehackernews.com\/2026\/02\/from-ransomware-to-residency-inside.html",
        "topic":"cybersecurity"
    },
    {
        "title":"Meta Quest v85 update preview: UI overhaul (again), surface keyboard, button customization, malware scanning, and a slow death for Horizon Worlds",
        "description":"Meta Quest firmware v85 may go down as one of the biggest and best updates in Quest history.",
        "content":"What you need to know\r\n<ul><li>Meta Quest v85 is now available to public test channel (PTC) users, including a new malware scanning feature, privacy indicator, voice control for 2D windows, passkey s… [+5292 chars]",
        "source":"Android Central",
        "published_at":"2026-02-02T15:12:58Z",
        "url":"https:\/\/www.androidcentral.com\/gaming\/virtual-reality\/meta-quest-3-v85-update-preview",
        "topic":"cybersecurity"
    },
    {
        "title":"TeamPCP Worm Exploits Cloud Infrastructure to Build Criminal Infrastructure",
        "description":"Cybersecurity researchers have called attention to a \"massive campaign\" that has systematically targeted cloud native environments to set up malicious infrastructure for follow-on exploitation.\nThe activity, observed around December 25, 2025, and described as…",
        "content":"Cybersecurity researchers have called attention to a \"massive campaign\" that has systematically targeted cloud native environments to set up malicious infrastructure for follow-on exploitation.\r\nThe … [+5307 chars]",
        "source":"Internet",
        "published_at":"2026-02-09T08:37:00Z",
        "url":"https:\/\/thehackernews.com\/2026\/02\/teampcp-worm-exploits-cloud.html",
        "topic":"cybersecurity"
    },
    {
        "title":"A New AI Math Startup Just Cracked 4 Previously Unsolved Problems",
        "description":"Axiom says its AI found solutions to several long-standing math problems, a sign of the technology’s steadily advancing reasoning capabilities.",
        "content":"Five years ago, mathematicians Dawei Chen and Quentin Gendron were trying to untangle a difficult area of algebraic geometry involving differentials, elements of calculus used to measure distance alo… [+3763 chars]",
        "source":"Wired",
        "published_at":"2026-02-04T19:00:00Z",
        "url":"https:\/\/www.wired.com\/story\/a-new-ai-math-ai-startup-just-cracked-4-previously-unsolved-problems\/",
        "topic":"cybersecurity"
    },
    {
        "title":"US Cyber Defense Chief Uploaded Sensitive Files Into a Public Version of ChatGPT",
        "description":"An anonymous reader quotes a report from Politico: The interim head of the country's cyber defense agency uploaded sensitive contracting documents into a public version of ChatGPT last summer, triggering multiple automated security warnings that are meant to …",
        "content":"The interim head of the country's cyber defense agency uploaded sensitive contracting documents into a public version of ChatGPT last summer, triggering multiple automated security warnings that are … [+1345 chars]",
        "source":"Slashdot.org",
        "published_at":"2026-01-28T22:02:00Z",
        "url":"https:\/\/yro.slashdot.org\/story\/26\/01\/28\/2144213\/us-cyber-defense-chief-uploaded-sensitive-files-into-a-public-version-of-chatgpt",
        "topic":"cybersecurity"
    },
    {
        "title":"Notepad++ updates got hijacked for months and could have spied for China",
        "description":"Users of the text and code editor Notepad++ may have unknowingly downloaded a malicious update for the app after its shared hosting servers were hijacked last year. On Monday, the app's developer, Don Ho, posted an update on the attack with more details, incl…",
        "content":"<ul><li><\/li><li><\/li><li><\/li><\/ul>\r\nThe apps servers were compromised from June through December 2025.\r\nThe apps servers were compromised from June through December 2025.\r\nby\r\nStevie BonifieldClose… [+3175 chars]",
        "source":"The Verge",
        "published_at":"2026-02-02T20:43:27Z",
        "url":"https:\/\/www.theverge.com\/tech\/872462\/notepad-plus-plus-server-hijacking",
        "topic":"cybersecurity"
    },
    {
        "title":"Google Cloud’s customer chief returns to Microsoft as head of security",
        "description":"Microsoft has a new head of security. Hayete Gallot, who left Microsoft in October 2024 to become the president of Google Cloud's customer experience, is returning to the software giant as the executive vice president of security, reporting directly to CEO Sa…",
        "content":"<ul><li><\/li><li><\/li><li><\/li><\/ul>\r\nHayete Gallot previously spent nearly 16 years at Microsoft in senior leadership roles across engineering and sales.\r\nHayete Gallot previously spent nearly 16 ye… [+2933 chars]",
        "source":"The Verge",
        "published_at":"2026-02-04T17:27:30Z",
        "url":"https:\/\/www.theverge.com\/news\/873930\/google-cloud-hayete-gallot-microsoft-security",
        "topic":"cybersecurity"
    },
    {
        "title":"Microsoft handed the government ecryption keys for customer data",
        "description":"The FBI went to Microsoft last year with a warrant, asking them to hand over keys to unlock encrypted data stored on three laptops as part of an investigation into potential fraud involving the COVID unemployment assistance program in Guam - and Microsoft com…",
        "content":"<ul><li><\/li><li><\/li><li><\/li><\/ul>\r\nPrivacy advocates are worried about the precedent this sets and the potential for abuse.\r\nPrivacy advocates are worried about the precedent this sets and the pot… [+3098 chars]",
        "source":"The Verge",
        "published_at":"2026-01-24T22:39:57Z",
        "url":"https:\/\/www.theverge.com\/news\/867244\/microsoft-bitlocker-privacy-fbi",
        "topic":"cybersecurity"
    },
    {
        "title":"Ransomware crims forced to take off-RAMP as FBI seizes forum",
        "description":"Cybercrime solved. The end\nRansomware crims have just lost one of their best business platforms. US law enforcement has seized the notorious RAMP cybercrime forum's dark web and clearnet domains.…",
        "content":"Ransomware crims have just lost one of their best business platforms. US law enforcement has seized the notorious RAMP cybercrime forum's dark web and clearnet domains.\r\nRAMP, which stands for Russia… [+2718 chars]",
        "source":"Theregister.com",
        "published_at":"2026-01-28T21:26:40Z",
        "url":"https:\/\/www.theregister.com\/2026\/01\/28\/fbi_seizes_ramp_forum\/",
        "topic":"cybersecurity"
    },
    {
        "title":"Devs Behind Steam Game With Over 300,000 Reviews Hit The Panic Button After A Malicious Mod Starts Deleting Fans’ Data",
        "description":"People Playground players are being urged to wipe their Steam Workshop mod lists\nThe post Devs Behind Steam Game With Over 300,000 Reviews Hit The Panic Button After A Malicious Mod Starts Deleting Fans’ Data appeared first on Kotaku.",
        "content":"The creators of People Playground, a lo-fi, cartoonishly gory sandbox with over 300,000 Steam reviews, have warned players to update the game immediately and delete all of their mods after a maliciou… [+1770 chars]",
        "source":"Kotaku",
        "published_at":"2026-02-02T14:53:03Z",
        "url":"https:\/\/kotaku.com\/people-playground-steam-mod-workshop-virus-2000665028",
        "topic":"cybersecurity"
    },
    {
        "title":"\"About any type of account imaginable\" — 149 million usernames and passwords exposed, and it's way more than just Outlook, OnlyFans, and Gmail",
        "description":"Cybersecurity researcher Jeremiah Fowler has published findings of a massive 96GB exposed trove containing 149 million credentials for a wide range of sites and services.",
        "content":"A 96GB database containing more than 149 million logins and passwords was recently discovered by respected cybersecurity researcher Jeremiah Fowler. The findings, which ExpressVPN published in its re… [+3535 chars]",
        "source":"Windows Central",
        "published_at":"2026-01-27T14:23:15Z",
        "url":"https:\/\/www.windowscentral.com\/software-apps\/149-million-logins-passwords-exposed-outlook-gmail",
        "topic":"cybersecurity"
    },
    {
        "title":"This cybersecurity CEO says we're in an AI bubble. These are the 3 things he looks for when investing in a startup.",
        "description":"The CEO of Cato Networks, Shlomo Kramer, said that some companies are still worth investing in. Here are the 3 things he looks for.",
        "content":"Shlomo Kramer said he believes we're in an AI bubble.Photoset\r\n<ul><li>Cato Networks CEO Shlomo Kramer said we're experiencing an AI bubble.<\/li><li>As a serial entrepreneur, he said he invests in co… [+3265 chars]",
        "source":"Business Insider",
        "published_at":"2026-02-13T10:18:01Z",
        "url":"https:\/\/www.businessinsider.com\/what-cato-networks-ceo-looks-for-investing-in-startups-2026-2",
        "topic":"cybersecurity"
    },
    {
        "title":"FBI warns QR code phishing used in North Korean cyber spying",
        "description":"The North Korean hacking group Kimsuky is using QR code phishing to target Americans with fake questionnaires and malicious websites, the FBI warns.",
        "content":"The Federal Bureau of Investigation has issued a warning about a growing cyber threat that turns everyday QR codes into spying tools.\r\nAccording to the bureau, a North Korean government-sponsored hac… [+7668 chars]",
        "source":"Fox News",
        "published_at":"2026-01-21T14:05:18Z",
        "url":"https:\/\/www.foxnews.com\/tech\/fbi-warns-qr-code-phishing-used-north-korean-cyber-spying",
        "topic":"cybersecurity"
    },
    {
        "title":"This Is The Best Antivirus For Windows, According To Consumer Reports",
        "description":"Computers of any kind are at risk of receiving malware, and even though Windows 11 comes with Microsoft Defender Antivirus protection, it's not foolproof.",
        "content":"Avira Free Security is the company's zero-cost antivirus solution and can protect your PC from malware and phishing. It comes with an on-demand virus scanner and a real-time threat monitor to guard y… [+1551 chars]",
        "source":"BGR",
        "published_at":"2026-02-11T13:17:00Z",
        "url":"https:\/\/www.bgr.com\/2095138\/secure-windows-antivirus-consumer-reports\/",
        "topic":"cybersecurity"
    },
    {
        "title":"CrashFix Chrome Extension Delivers ModeloRAT Using ClickFix-Style Browser Crash Lures",
        "description":"Cybersecurity researchers have disclosed details of an ongoing campaign dubbed KongTuke that used a malicious Google Chrome extension masquerading as an ad blocker to deliberately crash the web browser and trick victims into running arbitrary commands using C…",
        "content":"Cybersecurity researchers have disclosed details of an ongoing campaign dubbed KongTuke that used a malicious Google Chrome extension masquerading as an ad blocker to deliberately crash the web brows… [+6979 chars]",
        "source":"Internet",
        "published_at":"2026-01-19T09:09:00Z",
        "url":"https:\/\/thehackernews.com\/2026\/01\/crashfix-chrome-extension-delivers.html",
        "topic":"cybersecurity"
    },
    {
        "title":"Compromised dYdX npm and PyPI Packages Deliver Wallet Stealers and RAT Malware",
        "description":"Cybersecurity researchers have discovered a new supply chain attack in which legitimate packages on npm and the Python Package Index (PyPI) repository have been compromised to push malicious versions to facilitate wallet credential theft and remote code execu…",
        "content":"Cybersecurity researchers have discovered a new supply chain attack in which legitimate packages on npm and the Python Package Index (PyPI) repository have been compromised to push malicious versions… [+6509 chars]",
        "source":"Internet",
        "published_at":"2026-02-06T08:40:00Z",
        "url":"https:\/\/thehackernews.com\/2026\/02\/compromised-dydx-npm-and-pypi-packages.html",
        "topic":"cybersecurity"
    },
    {
        "title":"Security Bug in StealC Malware Panel Let Researchers Spy on Threat Actor Operations",
        "description":"Cybersecurity researchers have disclosed a cross-site scripting (XSS) vulnerability in the web-based control panel used by operators of the StealC information stealer, allowing them to gather crucial insights on one of the threat actors using the malware in t…",
        "content":"Cybersecurity researchers have disclosed a cross-site scripting (XSS) vulnerability in the web-based control panel used by operators of the StealC information stealer, allowing them to gather crucial… [+4650 chars]",
        "source":"Internet",
        "published_at":"2026-01-19T06:53:00Z",
        "url":"https:\/\/thehackernews.com\/2026\/01\/security-bug-in-stealc-malware-panel.html",
        "topic":"cybersecurity"
    },
    {
        "title":"Fake Moltbot AI Coding Assistant on VS Code Marketplace Drops Malware",
        "description":"Cybersecurity researchers have flagged a new malicious Microsoft Visual Studio Code (VS Code) extension for Moltbot (formerly Clawdbot) on the official Extension Marketplace that claims to be a free artificial intelligence (AI) coding assistant, but stealthil…",
        "content":"Cybersecurity researchers have flagged a new malicious Microsoft Visual Studio Code (VS Code) extension for Moltbot (formerly Clawdbot) on the official Extension Marketplace that claims to be a free … [+4328 chars]",
        "source":"Internet",
        "published_at":"2026-01-28T17:46:00Z",
        "url":"https:\/\/thehackernews.com\/2026\/01\/fake-moltbot-ai-coding-assistant-on-vs.html",
        "topic":"cybersecurity"
    },
    {
        "title":"Ingram Micro admits summer ransomware raid exposed thousands of staff records",
        "description":"Maine filing confirms July attack affected 42,521 employees and job applicants\nIngram Micro disclosed that a July 2025 ransomware attack compromised the personal data of tens of thousands of employees.…",
        "content":"Ingram Micro disclosed that a July 2025 ransomware attack compromised the personal data of tens of thousands of employees.\r\nThe distributor's filing with the attorney general's office in Maine confir… [+2310 chars]",
        "source":"Theregister.com",
        "published_at":"2026-01-19T12:32:09Z",
        "url":"https:\/\/www.theregister.com\/2026\/01\/19\/ingram_micro_ransomware_affects\/",
        "topic":"cybersecurity"
    }
]